[
  {
    "background": [
      "With over seven years of experience in game development and a strong background in software engineering, I have gained valuable skills and expertise in various aspects of the industry. I hold an engineer's degree in Computer Software Engineering from Hanoi University of Science and Technology, where I acquired a solid foundation in practical subjects and developed strong product development skills. Additionally, I pursued a master's degree in management and soft skills to enhance my overall competencies.",
      "Throughout my career, I have worked on a diverse range of projects, including 2D and 3D strategy games, Tower Defense games, AR/VR experiences, and card games. I have experience in full-stack development, where I have been responsible for developing, deploying, and publishing games for different markets. My role has involved implementing game features and components, maintaining source code, troubleshooting and optimizing performance, and collaborating closely with cross-functional teams of developers, artists, project managers, and game designers.",
      "I have extensive knowledge and proficiency in Unity engine, C#, and other related tools and technologies such as Git, Restful-API, JSON, Firebase, and SQL. I am also experienced in using languages like Objective-C, Java, Swift, and Bash to develop SDKs and tools for game development. In addition, I have worked with various project management tools, including Trello, Redmine, Jira, and agile methodologies.",
      "Driven by a passion for game development, I am constantly seeking to improve my skills and stay up-to-date with the latest industry trends. I am a diligent and focused individual with a strong attention to detail, which allows me to deliver high-quality work. My ability to work effectively in cross-functional teams and my excellent communication skills enable me to collaborate seamlessly with colleagues and stakeholders.",
      "I invite you to explore my portfolio, which showcases my diverse projects and demonstrates my technical skills, problem-solving abilities, and creativity in game development. I am confident that my background and experience make me a valuable asset in any game development team.",
      "Please find attached my detailed work experience and projects for your reference. I look forward to discussing further how my qualifications align with your requirements in an interview."
    ]
  }
]